In [2]:
# apply 메서드 활용

In [3]:
# 간단한 함수 만들기

In [5]:
def my_sq(x):
    return x ** 2
def my_exp(x,n):
    return x ** n

In [6]:
my_sq(3)

9

In [7]:
my_exp(3,3)

27

In [30]:
import pandas as pd

In [31]:
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [32]:
df['a'].apply(my_sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [33]:
df['a'].apply(my_exp, n=3)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [34]:
def print_me(x):
    print(x)

In [35]:
df.apply(print_me)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [36]:
df.apply(print_me, axis=1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [37]:
df.apply(my_exp, n=2)

     a     b
0  100   400
1  400   900
2  900  1600

In [38]:
df.apply(my_exp, n=2, axis=1)

     a     b
0  100   400
1  400   900
2  900  1600

In [39]:
def data_sum(x):
    return sum(x)

In [40]:
df.apply(data_sum)

a    60
b    90
dtype: int64

In [41]:
df.apply(data_sum, axis=1)

0    30
1    50
2    70
dtype: int64

In [42]:
df = pd.DataFrame({'a':[10,20,30], 'b':[40,50,60]})
df

    a   b
0  10  40
1  20  50
2  30  60

In [43]:
def data_sum(x):
    print(x[0])
    print(x[1])
    return x[0]*x[1]

In [46]:
df[['a','b']].apply(data_sum, axis=0)

10
20
40
50

a     200
b    2000
dtype: int64

In [47]:
df[['a','b']].apply(data_sum, axis=1)

10
40
20
50
30
60

0     400
1    1000
2    1800
dtype: int64